{
	"simulationYears": {
		"name": "Years to run the simulation for",
		"description": "How many years of content production we're testing for",
		"default": 30,
		"min": 5,
		"max": 200
	},
	"maxYearsTillMaxProfitability": {
		"name": "Maximum Years till Max Profitability",
		"description": "What is the maximum period of time before a copyrighted work becomes profitable",
		"default": 10,
		"min": 0,
		"max": 20
	},
	"maxWorksPerEntity": {
		"name": "Maximum Copyrighted Works the most powerful entity can have",
		"description": "Disney can produce far more copyrighted works in a year than the average individual. So, what is the maximum number of works such an entity can have. In case of total equality, everybody has this work producing capacity",
		"default": 50,
		"min": 2,
		"max": 150
	},
	"initialWealthInequality": {
		"name": "Initial Wealth Inequality (%)",
		"description": "Initial conditions for inequality. The average entity can only produce so much work. However, larger entity with more resources & revenue can produce more work. Higher this value, the more inequality in this productive capacity.",
		"default": 20,
		"min": 0,
		"max": 100
	},
	"contentProducingEntities": {
		"name": "Content Creators",
		"description": "The number of content producing entities",
		"default": 500,
		"min": 50,
		"max": 5000
	},
	"ideasFromPublicDomain": {
		"name": "Public domain content to new idea ratio",
		"description": "The number of public content works required to spawn a new idea. Say, if there are 100 works in the public domain and out of those, one new work is derived. Then, the ration would be 100. This value is inversely proportional to total content generation.",
		"default": 500,
		"min": 50,
		"max": 5000
	},
	"derivativeFactor": {
		"name": "Derivative Factor (%)",
		"description": "How being a derivative work affects revenue generated. Higher values positively affect revenue of derivative works",
		"default": 100,
		"min": -200,
		"max": 200
	},
	"piracyMultiplier": {
		"name": "How much piracy exists",
		"description": "Piracy is modelled as being linearly & directly proportional to the revenue generated by a work and the length of the copyright term. This variables scales the piracy loss up or down",
		"default": 50,
		"min": 0,
		"max": 1000
	}
}